# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 01. Importing Data

In [2]:
# create path 
path = r'C:\Users\smerg\Instacart Grocery Basket Analysis'
# order data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)
# product data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'products.csv'), index_col = False)
# order wrangled
df_ords = pd.read_csv(os.path.join(path,'02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# What are Data Consistency Checks

In [3]:
# show data type
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [4]:
# create a dataframe
df_test = pd.DataFrame()

In [5]:
# create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [6]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [7]:
# check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\smerg\AppData\Local\Temp\ipykernel_18124\2671172800.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [8]:
df_test['mix'] = df_test['mix'].astype('str')

# Missing Values

In [9]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [10]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [11]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

addressing missing vaules

In [12]:
 df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [13]:
#compare the number of rows in your current dataframe
df_prods.shape

(49693, 5)

In [14]:
#cleaning data
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [15]:
#compare the number of rows in your current dataframe in cleaned data
df_prods_clean.shape

(49677, 5)

In [16]:
# another way to clean data
df_prods.dropna(inplace = True)

In [17]:
# command to drop only the NaNs from a particular column
df_prods.dropna(subset = ['product_name'], inplace = True)

# Duplicates

In [18]:
#Finding Duplicates

In [19]:
#will look for full duplicates within your dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [20]:
#duplicate rows that it finds are saved within the new df_dups dataframe
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [21]:
#Addressing Duplicates

In [22]:
df_prods_clean.shape

(49677, 5)

In [23]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [24]:
df_prods_clean_no_dups.shape

(49672, 5)

# task 4.5

In [25]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

In [26]:
# Checking for missing values
print(df_ords.isnull().sum())

# Checking for duplicates
print(df_ords.duplicated().sum())

# Checking data types
print(df_ords.dtypes)

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64
0
Unnamed: 0                  int64
order_id                    int64
user_id                     int64
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [27]:
# provides statistics like count, mean, std
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [28]:
#compare the number of rows in your current dataframe
df_ords.shape

(3421083, 7)

# Mixed Data Types

In [29]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [30]:
# create a dataframe
df_test = pd.DataFrame()

In [31]:
# create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [32]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [33]:
# check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\smerg\AppData\Local\Temp\ipykernel_18124\2671172800.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [34]:
df_test['mix'] = df_test['mix'].astype('str')

In [35]:
# Checking for missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [36]:
#Fill missing values with the median of the column
df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].mean()

#The choice of imputation was made because missing values in order_quantity likely represent missing data points rather than structural zeros. Using the mean provides a neutral estimate.

In [37]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,11.114836
1,1,2398795,1,2,3,7,11.114836
2,2,473747,1,3,3,12,11.114836
3,3,2254736,1,4,4,7,11.114836
4,4,431534,1,5,4,15,11.114836
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,11.114836
3421079,3421079,1854736,206209,11,4,10,11.114836
3421080,3421080,626363,206209,12,1,12,11.114836
3421081,3421081,2977660,206209,13,1,12,11.114836
3421082,3421082,272231,206209,14,6,14,11.114836

In [38]:
#compare the number of rows in your current dataframe
df_ords.shape

(3421083, 7)

In [39]:
#cleaning data
df_ords_clean = df_ords[df_ords['days_since_prior_order'].isnull() == False]

In [40]:
#compare the number of rows in your current dataframe in cleaned data
df_ords_clean.shape

(3421083, 7)

In [41]:
# another way to clean data
df_ords.dropna(inplace = True)

In [42]:
# command to drop only the NaNs from a particular column
df_ords.dropna(subset = ['days_since_prior_order'], inplace = True)

In [43]:
#will look for full duplicates within your dataframe
df_dups = df_ords_clean[df_ords_clean.duplicated()]

#Duplicated rows might result from errors during data entry or merging of datasets.

In [44]:
#duplicate rows that it finds are saved within the new df_dups dataframe
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [45]:
df_ords_clean.shape

(3421083, 7)

In [46]:
df_ords_clean_no_dups = df_ords_clean.drop_duplicates()

In [47]:
df_ords_clean_no_dups.shape

(3421083, 7)

# Tidying Up and Exporting Changes

In [48]:
#export orders data frame
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [49]:
#export orders data frame
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))